src/InformationRegisters/am_СчетчикЗапросовПоискаНоменклатуры/am_СчетчикЗапросовПоискаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>am_СчетчикЗапросовПоискаНоменклатуры</name>
  <resources>
    <name>Счетчик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТекстПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредложенноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/am_СчетчикЗапросовПоискаНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УвеличитьЗначениеСчетчика(Знач ТекстПоиска, Знач Номенклатура, Знач Источник, Знач Пользователь) Экспорт
	
	ПредложенноеНаименование = "";
	Если ПустаяСтрока(ТекстПоиска) Тогда
	    ТекстПоиска = "<пустой>";
	ИначеЕсли Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		ПредложенноеНаименование = am_ОбщийМодульСервер.ПолучитьНаименованиеПоТекстуПоиска(ТекстПоиска, Пользователь);
	КонецЕсли; 
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТекстПоиска 				= ТекстПоиска;
	МенеджерЗаписи.Номенклатура				= Номенклатура;
	МенеджерЗаписи.ПериодЗаписи 			= НачалоДня(ТекущаяДатаСеанса());
	МенеджерЗаписи.Источник					= Источник;
	МенеджерЗаписи.ПредложенноеНаименование	= ПредложенноеНаименование;
	МенеджерЗаписи.Пользователь				= Пользователь;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ТекстПоиска 				= ТекстПоиска;
	МенеджерЗаписи.Номенклатура				= Номенклатура;
	МенеджерЗаписи.ПериодЗаписи 			= НачалоДня(ТекущаяДатаСеанса());
	МенеджерЗаписи.Источник					= Источник;
	МенеджерЗаписи.ПредложенноеНаименование	= ПредложенноеНаименование;
	МенеджерЗаписи.Пользователь				= Пользователь;
	МенеджерЗаписи.Счетчик 					= МенеджерЗаписи.Счетчик + 1;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
